InformationRegisters/Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>Адреса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАдресногоОбъектаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГородВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Адреса/Forms/ФормаВыбораИзАдресногоКлассификатора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ГородВладелец) Тогда
		
		Если Параметры.ГородВладелец.Наименование = "Хабаровск" Тогда 
			
			НужныйКод = 27;
			
		Иначе
			
			НужныйКод = 28;
			
		КонецЕсли;
		
		СписокНаселенныхПунктов.Параметры.УстановитьЗначениеПараметра("Код", НужныйКод);
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СохранитьВыбор();
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьВыбор()

	СтруктураНаселенногоПункта = Новый Структура;
	СтруктураНаселенногоПункта.Вставить("Наименование",Элементы.СписокНаселенныхПунктов.ТекущиеДанные.Наименование);
	СтруктураНаселенногоПункта.Вставить("КодАдресногоОбъектаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодАдресногоОбъектаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодГородаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодГородаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодНаселенногоПунктаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодНаселенногоПунктаВКоде);
	СтруктураНаселенногоПункта.Вставить("КодРайонаВКоде", Элементы.СписокНаселенныхПунктов.ТекущиеДанные.КодРайонаВКоде);
	Закрыть(СтруктураНаселенногоПункта);

КонецФункции // СохранитьВыбор()

&НаКлиенте
Процедура СписокНаселенныхПунктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СохранитьВыбор();
	
КонецПроцедуры
